(window.webpackJsonp = window.webpackJsonp || []).push([["common"], {
    OYwG: function (t, e, i) {
        i("kdLP"),
            i("TOaw")
    },
    TOaw: function (t, e) {
        function i(t) {
            return (i = "function" == typeof Symbol && "symbol" == typeof Symbol.iterator ? function (t) {
                return typeof t
            }
                : function (t) {
                    return t && "function" == typeof Symbol && t.constructor === Symbol && t !== Symbol.prototype ? "symbol" : typeof t
                }
            )(t)
        }
        var l = {
            languages: ["en", "ru", "jp", "it", "zh", "tw", "de", "pt", "br", "fr", "es", "mx", "tr", "pl", "ko", "th", "vi", "ar"],
            sudokuText: {
                en: "Sudoku",
                fr: "Sudoku",
                jp: "ナンプレ",
                ru: "Судоку",
                de: "Sudoku",
                zh: "数独",
                tw: "數獨",
                br: "Sudoku",
                pt: "Sudoku",
                it: "Sudoku",
                tr: "Sudoku",
                ko: "스도쿠",
                es: "Sudoku",
                mx: "Sudoku",
                pl: "Sudoku",
                th: "Sudoku",
                vi: "Sudoku",
                ar: "سودوكو"
            },
            gpText: {
                en: "FREE - On Google Play",
                fr: "GRATUIT - Sur Google Play",
                jp: "無料 - Google Playで入手する",
                ru: "БЕСПЛАТНО - на Google Play",
                de: "KOSTENLOS - Bei Google Play",
                zh: "免费 – 去Google Play下载",
                tw: "免費 - 在Google Play上",
                br: "GRÁTIS - No Google Play",
                pt: "GRÁTIS - No Google Play",
                it: "GRATIS - Su Google Play",
                tr: "ÜCRETSİZ - Google Play'de",
                ko: "무료 - Google Play에서 받기",
                es: "GRATIS - En Google Play",
                mx: "GRATIS - En Google Play",
                pl: "ZA DARMO - w Google Play",
                th: "ฟรี - ที่ Google Play",
                vi: "MIỄN PHÍ - Trên Google Play",
                ar: "احصل عليه مجانًا - على متجر جوجل بلاي"
            },
            iosText: {
                en: "GET - On the App Store",
                fr: "OBTENIR - sur l'App Store",
                jp: "取得する - App Store で",
                ru: "УСТАНОВИТЬ - в App Store",
                de: "HOLEN - Im App Store",
                zh: "获取 - 在 App Store",
                tw: "取得 - 在 App Store",
                br: "OBTER - Na App Store",
                pt: "OBTER - Na App Store",
                it: "OTTENERE - Sull'App Store",
                tr: "EDİNMEK - App Store'dan",
                ko: "구입하기 - App Store에서",
                es: "CONSEGUIR - en la App Store",
                mx: "OBTENER - en la App Store",
                pl: "POBIERZ - w sklepie App Store",
                th: "รับ - บน App Store",
                vi: "TẢI - Trên App Store",
                ar: "اذهبوا إلى متجر التطبيقات"
            },
            installText: {
                en: "Install",
                fr: "Installer",
                jp: "インストール",
                ru: "Установить",
                de: "Installieren",
                zh: "安装",
                tw: "安裝",
                br: "Instalar",
                pt: "Instalar",
                it: "Installa",
                tr: "Yükle",
                ko: "설치",
                es: "Instalar",
                mx: "Instalar",
                pl: "Zainstaluj",
                th: "ติดตั้ง",
                vi: "Cài đặt",
                ar: "تثبيت"
            },
            viewText: {
                en: "View",
                fr: "Voir",
                jp: "閲覧する",
                ru: "Посмотреть",
                de: "Ansehen",
                zh: "查看",
                tw: "查看",
                br: "Ver",
                pt: "Ver",
                it: "Visualizzare",
                tr: "Görüntülemek",
                ko: "보기",
                es: "Ver",
                mx: "Ver",
                pl: "Zobacz",
                th: "ดู",
                vi: "Xem",
                ar: "شاهدوا"
            },
            gpLink: {
                en: "",
                fr: "&hl=fr_FR",
                jp: "&hl=ja_JP",
                ru: "&hl=ru_RU",
                de: "&hl=de_DE",
                zh: "&hl=zh_CN",
                tw: "&hl=zh_TW",
                br: "&hl=pt_BR",
                pt: "&hl=pt_PT",
                it: "&hl=it_IT",
                tr: "&hl=tr_TR",
                ko: "&hl=ko_KR",
                es: "&hl=es_ES",
                mx: "&hl=es_419",
                pl: "&hl=pl_PL",
                th: "&hl=th",
                vi: "&hl=vi",
                ar: "&hl=ar"
            },
            iosLink: {
                en: "/us",
                fr: "/fr",
                jp: "/jp",
                ru: "/ru",
                de: "/de",
                zh: "/cn",
                tw: "/tw",
                br: "/br",
                pt: "/pt",
                it: "/it",
                tr: "/tr",
                ko: "/kr",
                es: "/es",
                mx: "/mx",
                pl: "",
                th: "/th",
                vi: "/vn",
                ar: ""
            },
            monthFull: {
                en: ["January", "February", "March", "April", "May", "June", "July", "August", "September", "October", "November", "December"],
                ru: ["Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"],
                jp: ["1月", "2月", "3月", "4月", "5月", "6月", "7月", "8月", "9月", "10月", "11月", "12月"],
                it: ["Gennaio", "Febbraio", "Marzo", "Aprile", "Maggio", "Giugno", "Luglio", "Agosto", "Settembre", "Ottobre", "Novembre", "Dicembre"],
                zh: ["一月", "二月", "三月", "四月", "五月", "六月", "七月", "八月", "九月", "十月", "十一月", "十二月"],
                tw: ["一月", "二月", "三月", "四月", "五月", "六月", "七月", "八月", "九月", "十月", "十一月", "十二月"],
                de: ["Januar", "Februar", "März", "April", "Mai", "Juni", "Juli", "August", "September", "Oktober", "November", "Dezember"],
                pt: ["Janeiro", "Fevereiro", "Março", "Abril", "Maio", "Junho", "Julho", "Agosto", "Setembro", "Outubro", "Novembro", "Dezembro"],
                br: ["Janeiro", "Fevereiro", "Março", "Abril", "Maio", "Junho", "Julho", "Agosto", "Setembro", "Outubro", "Novembro", "Dezembro"],
                fr: ["Janvier", "Février", "Mars", "Avril", "Mai", "Juin", "Juillet", "Août", "Septembre", "Octobre", "Novembre", "Décembre"],
                es: ["Enero", "Febrero", "Marzo", "Abril", "Mayo", "Junio", "Julio", "Agosto", "Septiembre", "Octubre", "Noviembre", "Diciembre"],
                mx: ["Enero", "Febrero", "Marzo", "Abril", "Mayo", "Junio", "Julio", "Agosto", "Septiembre", "Octubre", "Noviembre", "Diciembre"],
                tr: ["Ocak", "Şubat", "Mart", "Nisan", "Mayıs", "Haziran", "Temmuz", "Ağustos", "Eylül", "Ekim", "Kasım", "Aralık"],
                pl: ["Styczeń", "Luty", "Marzec", "Kwiecień", "Maj", "Czerwiec", "Lipiec", "Sierpień", "Wrzesień", "Październik", "Listopad", "Grudzień"],
                ko: ["1월", "2월", "3월", "4월", "5월", "6월", "7월", "8월", "9월", "10월", "11월", "12월"],
                th: ["มกราคม", "กุมภาพันธ์", "มีนาคม", "เมษายน", "พฤษภาคม", "มิถุนายน", "กรกฎาคม", "สิงหาคม", "กันยายน", "ตุลาคม", "พฤศจิกายน", "ธันวาคม"],
                vi: ["Tháng 1", "Tháng 2", "Tháng 3", "Tháng 4", "Tháng 5", "Tháng 6", "Tháng 7", "Tháng 8", "Tháng 9", "Tháng 10", "Tháng 11", "Tháng 12"],
                ar: ["يناير/كانون الثاني", "فبراير/ شباط", "مارس/ آذار", "أبريل/نيسان", "مايو/آيار", "يونيو/حزيران", "يوليو/تموز", "أغسطس/آب", "سبتمبر/ايلول", "أكتوبر/تشرين الأول", "نوفمبر/تشرين الثاني", "ديسمبر/كانون الأول"]
            },
            weekDays: {
                en: ["Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun"],
                ru: ["Пн", "Вт", "Ср", "Чт", "Пт", "Сб", "Вс"],
                jp: ["月", "火", "水", "木", "金", "土", "日"],
                it: ["Lun", "Mar", "Mer", "Gio", "Ven", "Sab", "Dom"],
                zh: ["周一", "周二", "周三", "周四", "周五", "周六", "周日"],
                tw: ["週一", "週二", "週三", "週四", "週五", "週六", "週日"],
                de: ["Mo", "Di", "Mi", "Do", "Fr", "Sa", "So"],
                pt: ["Seg", "Ter", "Qua", "Qui", "Sex", "Sáb", "Dom"],
                br: ["Seg", "Ter", "Qua", "Qui", "Sex", "Sab", "Dom"],
                fr: ["Lun", "Mar", "Mer", "Jeu", "Ven", "Sam", "Dim"],
                es: ["Lun", "Mar", "Mié", "Jue", "Vie", "Sáb", "Dom"],
                mx: ["Lun", "Mar", "Mié", "Jue", "Vie", "Sáb", "Dom"],
                tr: ["Pt", "Sa", "Ça", "Pe", "Cu", "Ct", "Pa"],
                pl: ["Pon", "Wt", "Śr", "Czw", "Pt", "Sob", "Niedz"],
                ko: ["월", "화", "수", "목", "금", "토", "일"],
                th: ["จ.", "อ.", "พ.", "พฤ.", "ศ.", "ส.", "อา."],
                vi: ["Thứ hai", "Thứ ba", "Thứ tư", "Thứ năm", "Thứ sáu", "Thứ bảy", "Chủ nhật"],
                ar: ["الاثنين", "الثلاثاء", "الأربعاء", "الخميس", "الجمعة", "السبت", "الأحد"]
            }
        };
        window.scriptLocal = l;
        var a = {
            1: '<svg xmlns="http://www.w3.org/2000/svg" width="12" height="30" viewBox="0 0 12 30.8"><path fill="#344861" fill-rule="evenodd" d="M8.954 30V3.545h-.267c-.738.41-6.706 4.655-7.71 5.311V5.883c.635-.41 6.767-4.758 7.977-5.476h2.789V30h-2.79z"/></svg>',
            2: '<svg xmlns="http://www.w3.org/2000/svg" width="20" height="31" viewBox="0 0 20 31.4"><path fill="#344861" fill-rule="evenodd" d="M.12 9.57C.16 4.462 4.057.791 9.41.791c5.209 0 9.187 3.568 9.187 8.224 0 3.076-1.415 5.475-6.275 10.664l-7.998 8.53v.247h15.012V31H.284v-1.969L10.62 17.854c4.122-4.43 5.168-6.193 5.168-8.736 0-3.302-2.81-5.865-6.44-5.865-3.814 0-6.46 2.584-6.5 6.316v.02H.12v-.02z"/></svg>',
            3: '<svg xmlns="http://www.w3.org/2000/svg" width="21" height="32" viewBox="0 0 21 32"><path fill="#344861" fill-rule="evenodd" d="M6.698 16.932v-2.42h3.466c3.814 0 6.46-2.338 6.46-5.722 0-3.22-2.646-5.537-6.317-5.537-3.67 0-6.255 2.174-6.542 5.537H1.038C1.366 3.95 5.037.792 10.41.792c5.045 0 9.064 3.404 9.064 7.67 0 3.568-2.05 6.173-5.496 6.932v.266c4.225.472 6.85 3.281 6.85 7.342 0 4.86-4.491 8.613-10.295 8.613-5.722 0-9.926-3.404-10.11-8.182H3.13c.246 3.322 3.322 5.721 7.382 5.721 4.286 0 7.424-2.645 7.424-6.214 0-3.711-2.912-6.008-7.65-6.008H6.699z"/></svg>',
            4: '<svg xmlns="http://www.w3.org/2000/svg" width="24" height="30" viewBox="0 0 24 30.9"><path fill="#344861" fill-rule="evenodd" d="M15.855 30v-6.686H.987v-2.563C3.633 16.281 7.283 10.6 14.563.366h4.02v20.426h4.43v2.522h-4.43V30h-2.728zM3.92 20.628v.184h11.935V3.052h-.184C10.03 10.744 7.099 15.338 3.92 20.629z"/></svg>',
            5: '<svg xmlns="http://www.w3.org/2000/svg" width="21" height="31" viewBox="0 0 21 31.4"><path fill="#344861" fill-rule="evenodd" d="M10.553 30.615c-5.373 0-9.474-3.445-9.782-8.264H3.52c.308 3.322 3.322 5.783 7.055 5.783 4.327 0 7.424-3.097 7.424-7.445 0-4.347-3.097-7.444-7.363-7.444-2.912 0-5.496 1.415-6.747 3.692H1.222l1.6-16.53h16.14V2.93H5.037l-.985 10.787h.267c1.415-1.846 3.876-2.912 6.768-2.912 5.68 0 9.72 4.08 9.72 9.802 0 5.866-4.245 10.008-10.254 10.008z"/></svg>',
            6: '<svg xmlns="http://www.w3.org/2000/svg" width="22" height="32" viewBox="0 0 22 32"><path fill="#344861" fill-rule="evenodd" d="M10.964 31.595c-4 0-7.158-1.99-9.003-5.64C.648 23.638-.01 20.582-.01 16.83-.008 6.76 4.135.792 11.17.792c4.901 0 8.613 2.953 9.454 7.567h-2.871c-.739-3.076-3.323-5.045-6.624-5.045-5.312 0-8.347 4.963-8.409 13.74h.246c1.292-3.322 4.553-5.454 8.43-5.454 5.618 0 9.76 4.183 9.76 9.843 0 5.886-4.285 10.152-10.191 10.152zm-.041-2.482c4.204 0 7.403-3.281 7.403-7.567 0-4.368-3.097-7.506-7.383-7.506-4.225 0-7.485 3.158-7.485 7.3 0 4.41 3.24 7.773 7.465 7.773z"/></svg>',
            7: '<svg xmlns="http://www.w3.org/2000/svg" width="20" height="30" viewBox="0 0 20 30.8"><path fill="#344861" fill-rule="evenodd" d="M3.017 30L16.696 3.155V2.93H.29V.407h19.277v2.625L6.01 30z"/></svg>',
            8: '<svg xmlns="http://www.w3.org/2000/svg" width="22" height="32" viewBox="0 0 22 32"><path fill="#344861" fill-rule="evenodd" d="M10.533 31.615c-6.193 0-10.48-3.527-10.48-8.593 0-3.834 2.584-6.87 6.46-7.567v-.246c-3.22-.759-5.311-3.343-5.311-6.583 0-4.573 3.876-7.834 9.33-7.834 5.456 0 9.332 3.24 9.332 7.834 0 3.22-2.071 5.804-5.291 6.583v.246c3.855.697 6.46 3.732 6.46 7.567 0 5.086-4.286 8.593-10.5 8.593zm0-2.42c4.532 0 7.67-2.604 7.67-6.357 0-3.671-3.117-6.173-7.67-6.173-4.532 0-7.65 2.523-7.65 6.173 0 3.753 3.118 6.357 7.65 6.357zm0-14.95c3.896 0 6.562-2.174 6.562-5.393 0-3.343-2.666-5.64-6.562-5.64-3.897 0-6.563 2.297-6.563 5.64 0 3.199 2.666 5.393 6.563 5.393z"/></svg>',
            9: '<svg xmlns="http://www.w3.org/2000/svg" width="23" height="32" viewBox="0 0 23 32"><path fill="#344861" fill-rule="evenodd" d="M10.897 31.595c-4.983 0-8.613-2.974-9.454-7.547h2.871c.718 3.015 3.22 5.045 6.624 5.045 5.23 0 8.203-4.779 8.408-13.064.02-.205-.102-.471-.123-.676H19.1c-1.271 3.26-4.552 5.434-8.428 5.434-5.66 0-9.762-4.163-9.762-9.803C.91 5.1 5.175.792 11.102.792c4 0 7.157 2.01 9.003 5.68 1.313 2.298 1.969 5.333 1.969 9.106 0 10.028-4.102 16.017-11.177 16.017zm.226-13.248c4.245 0 7.485-3.2 7.485-7.28 0-4.39-3.22-7.794-7.465-7.794-4.224 0-7.403 3.302-7.403 7.63 0 4.285 3.035 7.444 7.383 7.444z"/></svg>',
            pencil: '<svg class="icon-game-control" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 30 30"><path fill="currentColor" fill-rule="evenodd" d="M3.73 28.124l6.329-2.11c.006-.003.009-.007.014-.01a.514.514 0 0 0 .191-.117L28.403 7.732a2.593 2.593 0 0 0 .763-1.843c0-.697-.271-1.35-.763-1.843L25.099.74c-.981-.986-2.697-.988-3.682 0L3.277 18.895a.497.497 0 0 0-.118.19c-.001.004-.006.007-.008.013L.026 28.48c-.005.015.002.03-.002.043-.01.041-.024.08-.024.122 0 .028.01.052.016.08a.512.512 0 0 0 .504.442h28.646V28.13L3.73 28.124zM18.75 4.882l5.512 5.518L9.895 24.781l-5.514-5.519L18.75 4.882zm3.403-3.405c.591-.593 1.62-.59 2.21 0l3.304 3.307a1.562 1.562 0 0 1 0 2.211L25 9.663l-5.514-5.518 2.667-2.668zM3.874 20.228L8.93 25.29l-7.586 2.531 2.53-7.593z"/></svg>',
            hint: '<svg class="icon-game-control" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 25 33"><path fill="currentColor" fill-rule="evenodd" d="M17.075 29.179L7.7 31.262a.522.522 0 0 0 .112 1.03.57.57 0 0 0 .114-.013l9.375-2.083a.52.52 0 1 0-.226-1.017M12.5 0C5.607 0 0 5.607 0 12.5a12.49 12.49 0 0 0 7.608 11.505.52.52 0 1 0 .408-.958A11.447 11.447 0 0 1 1.042 12.5c0-6.318 5.14-11.458 11.458-11.458 6.318 0 11.459 5.14 11.459 11.458 0 4.603-2.738 8.743-6.976 10.547a.522.522 0 0 0-.316.479v2.619L7.7 28.137a.522.522 0 0 0 .112 1.03.57.57 0 0 0 .114-.013l9.375-2.083a.522.522 0 0 0 .408-.509v-2.697A12.486 12.486 0 0 0 25 12.5C25 5.607 19.393 0 12.5 0"/></svg>',
            erase: '<svg class="icon-game-control" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 32 30"><path fill="currentColor" fill-rule="evenodd" d="M13.861 28.126l7.01-7.017.004-.003.002-.002 9.58-9.59a2.584 2.584 0 0 0 .763-1.842c0-.695-.271-1.35-.763-1.843L23.373.739c-.986-.986-2.7-.984-3.682 0l-9.58 9.59-.004.002-.002.003-9.344 9.35A2.592 2.592 0 0 0 0 21.529c0 .695.27 1.35.761 1.842l5.64 5.645a.528.528 0 0 0 .369.153h24.48v-1.042H13.861zm6.566-26.65c.591-.587 1.621-.59 2.209 0l7.084 7.09c.295.295.458.688.458 1.106 0 .418-.163.81-.458 1.105L20.506 20l-9.292-9.302 9.213-9.222zM6.986 28.126l-5.488-5.492a1.557 1.557 0 0 1-.457-1.105c0-.418.163-.81.457-1.106l8.979-8.986 9.291 9.302-7.381 7.387H6.986z"/></svg>',
            undo: '<svg class="icon-game-control" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 27 27"><path fill="currentColor" fill-rule="evenodd" d="M13.021 0C9.207 0 5.589 1.715 3.125 4.609V.521a.521.521 0 0 0-1.042 0v5.208c0 .288.234.521.521.521h5.208a.522.522 0 1 0 0-1.042H3.977c2.267-2.619 5.566-4.166 9.044-4.166C19.625 1.042 25 6.416 25 13.021 25 19.626 19.625 25 13.021 25 6.416 25 1.042 19.626 1.042 13.021a.521.521 0 0 0-1.042 0c0 7.18 5.84 13.021 13.021 13.021 7.18 0 13.021-5.841 13.021-13.021C26.042 5.841 20.201 0 13.021 0"/></svg>',
            winStar: '<svg viewBox="0 0 30 30"><path fill="#FFFFFF" d="M15.8,29h-1.6c0-7.3-5.9-13.2-13.2-13.2v-1.6c7.3,0,13.2-5.9,13.2-13.2h1.6c0,7.3,5.9,13.2,13.2,13.2v1.6C21.7,15.8,15.8,21.7,15.8,29z"></path></svg>',
            winRays: '<svg viewBox="0 0 360 360" ><g fill-rule="nonzero"><circle fill="none" cx="180" cy="180" r="179"></circle> <path fill="url(#SVGID_1_)" d="M179.9,358.5c11.7,0,23.1-1.1,34.3-3.3l-34.3-175.5l-36.8,175C155,357.2,167.3,358.5,179.9,358.5z"></path> <path fill="url(#SVGID_2_)" d="M71.1,321.6l108.8-141.9l-149,99C41.9,295.1,55.4,309.6,71.1,321.6z"></path> <path fill="url(#SVGID_3_)" d="M12,118.2l167.9,61.6L73.5,36.1C45.7,56.7,24.1,85.2,12,118.2z"></path><path fill="url(#SVGID_4_)" d="M179.9,179.8l106.5,143.6c20.6-15.3,37.7-34.9,50.2-57.5L179.9,179.8z"></path> <path fill="url(#SVGID_5_)" d="M209.4,3.4l-29.5,176.3l84.8-157.4C247.7,13.2,229.1,6.7,209.4,3.4z"></path><path fill="url(#SVGID_6_)" d="M143.4,4.7l36.4,175.1l-21-177.6C153.6,2.8,148.5,3.7,143.4,4.7z"></path></g></svg>',
            confetti: '<svg viewBox="0 0 413 865"><path id="Fill-1" fill="#8AD4FF" d="M55,20.4c0.2-3.9-3.5-5.7-5.3-8.4c-1.4,2.6-3.9,5.2-6.7,5.6c2.7,1.7,3.5,5.1,3,8.4C51.4,23.9,53.2,22.8,55,20.4"></path><path id="Fill-3" fill="#FF96AF" d="M164,576.4c1.9,3,6.1,2.4,9.1,3.6c-0.1-2.6,0.7-5.7,2.9-7.4c-3.3,0.1-5.8-2-7-4.6C165.7,571.8,164.3,573.6,164,576.4"></path><path id="Fill-5" fill="#FFE019" d="M135,145.6l1.7-23.6c3.6,2.1,5.8,1.6,9.3,0.7c-1.4,8.9-2.2,14.7-1.7,23.6C140.5,147.5,138.4,147,135,145.6"></path><path id="Fill-5-Copy-6" fill="#FFE019" d="M135,582.6l1.7-23.6c3.6,2.1,5.8,1.6,9.3,0.7c-1.4,8.9-2.2,14.7-1.7,23.6C140.5,584.5,138.4,584,135,582.6"></path> <path id="Fill-7" fill="#FFD510" d="M389.3,299l17.7,13.5c-3.5,1.5-4.2,3.4-5.3,6.4c-6.3-5.6-10.5-9.3-17.7-13.5C385,302,386.5,300.7,389.3,299"></path><path id="Fill-7-Copy-3" fill="#FFD510" d="M389.3,736l17.7,13.5c-3.5,1.5-4.2,3.4-5.3,6.4c-6.3-5.6-10.5-9.3-17.7-13.5C385,739,386.5,737.7,389.3,736"></path><path id="Fill-10" fill="#8AD4FF" d="M70.1,498c3.2-0.5,3.9-3.7,5.9-5.5c-2.4-0.7-4.9-2.3-5.8-4.5c-0.9,2.4-3.5,3.6-6.2,3.7C66.7,495.7,67.9,497,70.1,498"></path><path id="Fill-12" fill="#8AD4FF" d="M405.3,558L377,541.7c4.9-2.6,5.6-5.4,6.8-9.7c10.2,7,16.9,11.4,28.3,16.3C411.2,553.2,409.1,555.2,405.3,558"></path> <path id="Fill-15" fill="#FFFFFF" d="M116.9,527c2.7-0.3,3.4-2.9,5.1-4.3c-2-0.6-4.1-1.9-4.7-3.7c-0.8,1.9-3,2.8-5.3,2.8C114,524.8,115,526.1,116.9,527"></path> <path id="Fill-17" fill="#FF96AF" d="M262.1,47.9c-0.5,2.6,2.2,4.1,3.3,6.1c1.3-1.6,3.4-3.2,5.6-3.2c-1.9-1.3-2.2-3.7-1.6-5.8C265.5,45.9,263.7,46.4,262.1,47.9"></path><path id="Fill-19" fill="#B68FFF" d="M265,524.6c-4.1,4.6-0.7,10.3-1,15.4c4.6-1.8,10.6-2.6,14.8-0.3c-2.1-4.7,0.2-9.7,4.1-13.1C273.4,524,269.8,523.4,265,524.6"></path><path id="Fill-21" fill="#FFFFFF" d="M216.9,466.8c2.8-1.6,6.5-0.8,8.3,1.8c1.7,2.6,0.9,6-2,7.6c-2.8,1.6-6.5,0.8-8.3-1.8C213.2,471.8,214,468.4,216.9,466.8"></path><path id="Fill-23" fill="#FF96AF" d="M340,159.1c4.2,5,10.2,8.6,17.7,9.9c-1-3.4,2.1-6.3,5.3-7.4c-6.2-1.4-11.5-3.8-18.5-9.5c-0.8-0.8-2.9,2.6-3.8,4.7C340.4,157.5,340.2,158.3,340,159.1"></path><path id="Fill-23-Copy" fill="#FF96AF" d="M340,596.1c4.2,5,10.2,8.6,17.7,9.9c-1-3.4,2.1-6.3,5.3-7.4c-6.2-1.4-11.5-3.8-18.5-9.5c-0.8-0.8-2.9,2.6-3.8,4.7C340.4,594.5,340.2,595.3,340,596.1"></path><path id="Fill-25" fill="#8AD4FF" d="M366.6,14.1L345.2,17c1.2-3,0.3-4.6-1.2-7.1c8.2-0.5,13.6-1,21.5-2.9C367.3,9.6,367.2,11.3,366.6,14.1"></path><path id="Fill-27" fill="#8AD4FF" d="M282.6,599.5c-1.4,5.7-0.6,11.8,2.8,17.7c2-2.6,5.9-2.2,8.5-0.7c-2.4-4.8-3.8-9.8-3.5-18c0.1-1-3.6-0.5-5.7,0.1C284.1,598.9,283.4,599.2,282.6,599.5"></path><path id="Fill-30" fill="#8AD4FF" d="M235.8,0L250,9.1c-2.6,1.2-3.1,2.6-3.8,4.9c-5.1-3.9-8.4-6.3-14.2-9.1C232.6,2.4,233.7,1.4,235.8,0"></path><path id="Fill-32" fill="#B68FFF" d="M25,377.7L4.9,391c-0.3-4.1-2.1-5.5-4.9-7.7c8-4.4,13.2-7.4,20.1-13.3C23.3,372.2,24.1,374.2,25,377.7"></path><path id="Fill-32-Copy" fill="#B68FFF" d="M25,814.7L4.9,828c-0.3-4.1-2.1-5.5-4.9-7.7c8-4.4,13.2-7.4,20.1-13.3C23.3,809.2,24.1,811.2,25,814.7"></path><path id="Fill-35" fill="#FFD510" d="M59.6,158c4.5-1,8.5-3.4,11.4-7.2c-2.5-0.3-3.6-2.7-3.4-4.8c-2.6,3-5.6,5.3-11.4,7.7c-0.7,0.2,0.9,2.2,2.1,3.3C58.6,157.3,59.1,157.7,59.6,158"></path><path id="Fill-35-Copy" fill="#FFD510" d="M59.6,595c4.5-1,8.5-3.4,11.4-7.2c-2.5-0.3-3.6-2.7-3.4-4.8c-2.6,3-5.6,5.3-11.4,7.7c-0.7,0.2,0.9,2.2,2.1,3.3C58.6,594.3,59.1,594.7,59.6,595"></path><path id="Fill-37" fill="#FFFFFF" d="M369.6,49.8c-1.7,2.8,0.6,5.5,0.9,8.2c2.2-1.3,5.2-2.2,7.6-1.4c-1.5-2.3-0.8-5.1,0.9-7.2C374.3,48.9,372.2,48.7,369.6,49.8"></path><path id="Fill-39" fill="#B68FFF" d="M294.4,185.4c1.6-2.4-0.3-5-0.5-7.4c-2,1.1-4.7,1.8-6.8,1c1.2,2.1,0.5,4.6-1.1,6.5C290.8,186.2,292.3,186.2,294.4,185.4"></path><path id="Fill-39-Copy" fill="#B68FFF" d="M294.4,622.4c1.6-2.4-0.3-5-0.5-7.4c-2,1.1-4.7,1.8-6.8,1c1.2,2.1,0.5,4.6-1.1,6.5C290.8,623.2,292.3,623.2,294.4,622.4"></path><path id="Fill-41" fill="#FFE019" d="M65,435.3c-3.7-5.6-9.5-10-17.3-12.3c0.5,3.6-3.1,6.1-6.7,6.8c6.2,2.1,11.5,5.2,18.2,12c0.7,0.9,3.4-2.3,4.8-4.3C64.3,436.8,64.6,436.1,65,435.3"></path><path id="Fill-43" fill="#8AD4FF" d="M254,69c-2.7-2-6.2-3.2-10.2-3c0.9,1.6-0.3,3.3-1.8,4.2c3.2,0,6.2,0.6,10.5,2.7c0.5,0.3,1.2-1.6,1.4-2.7C254,69.9,254,69.5,254,69"></path><path id="Fill-45" fill="#FFFFFF" d="M369,189.5c1,2.3,4,2.3,6,3.5c0.2-1.9,1.2-4,3-5c-2.3-0.3-3.8-2-4.4-4C370.8,186.4,369.6,187.6,369,189.5"></path><path id="Fill-45-Copy" fill="#FFFFFF" d="M369,626.5c1,2.3,4,2.3,6,3.5c0.2-1.9,1.2-4,3-5c-2.3-0.3-3.8-2-4.4-4C370.8,623.4,369.6,624.6,369,626.5"></path><path id="Fill-47" fill="#8AD4FF" d="M36.3,572c-5,1.8-9.4,5.2-12.3,10.4c3,0.1,4.5,3,4.6,5.6c2.6-4,5.7-7.3,12.2-11c0.8-0.4-1.4-2.7-2.8-3.9C37.5,572.7,36.9,572.4,36.3,572"></path><path id="Fill-49" fill="#8AD4FF" d="M223.8,77.2c0.8-5.1-0.4-10.3-3.6-15.2c-1.5,2.4-4.8,2.3-7.2,1.2c2.4,4.1,3.9,8.3,4.2,15.4c0,0.8,3.1,0.2,4.8-0.5C222.6,77.9,223.2,77.6,223.8,77.2"></path><path id="Fill-51" fill="#8AD4FF" d="M352.3,452c-2.7,0.2-3.6,2.7-5.3,4.1c2,0.7,4,2.1,4.5,3.9c0.9-1.9,3.2-2.7,5.5-2.6C355,454.1,354.1,453,352.3,452"></path><path id="Fill-53" fill="#FFE019" d="M25.8,10c-3.4-1.9-7.4-2.6-11.7-1.6c1.3,1.7,0.3,4-1.1,5.3c3.5-0.6,6.9-0.4,12,1.3c0.6,0.2,0.9-2.1,1-3.5C26,11,25.9,10.6,25.8,10"></path><path id="Fill-56" fill="#FF96AF" d="M144,5.8c-0.2,2.8,2.6,4.1,3.8,6.2c1.1-1.9,3-3.7,5.2-3.9c-2-1.3-2.5-3.8-2.1-6.1C147.1,3.3,145.5,4,144,5.8"></path><path id="Fill-58" fill="#FFD510" d="M247,451.9c1.1,2.8,4.5,2.8,6.7,4.1c0.2-2.3,1.2-4.9,3.3-6.2c-2.6-0.3-4.3-2.4-5-4.8C248.6,448.3,247.6,449.6,247,451.9"></path><path id="Fill-60" fill="#FFD510" d="M253.7,333c4.5-1,8.4-3.5,11.3-7.3c-2.6-0.3-3.6-2.7-3.5-4.7c-2.5,3-5.5,5.3-11.3,7.8c-0.7,0.2,1,2.2,2.1,3.3C252.7,332.4,253.1,332.7,253.7,333"></path><path id="Fill-60-Copy" fill="#FFD510" d="M253.7,770c4.5-1,8.4-3.5,11.3-7.3c-2.6-0.3-3.6-2.7-3.5-4.7c-2.5,3-5.5,5.3-11.3,7.8c-0.7,0.2,1,2.2,2.1,3.3C252.7,769.4,253.1,769.7,253.7,770"></path><path id="Fill-62" fill="#FFE019" d="M371,267.4l-10.3,8.6c-0.7-2-1.9-2.5-3.7-3.4c4.2-3,6.9-5,10.3-8.6C369.4,264.8,370.1,265.7,371,267.4"></path><path id="Fill-62-Copy" fill="#FFE019" d="M371,704.4l-10.3,8.6c-0.7-2-1.9-2.5-3.7-3.4c4.2-3,6.9-5,10.3-8.6C369.4,701.8,370.1,702.7,371,704.4"></path><path id="Fill-64" fill="#B68FFF" d="M384.2,90.2c-0.5,3.3,0.3,6.7,2.6,9.8c1.1-1.6,3.5-1.5,5.2-0.8c-1.8-2.7-2.8-5.4-3.1-10c0-0.5-2.2-0.1-3.5,0.3C385,89.7,384.6,89.9,384.2,90.2"></path><path id="Fill-66" fill="#8AD4FF" d="M62,364.6c-0.2-5.2-5.9-7.1-8.7-10.6c-1.8,3.7-5.1,7.4-9.3,8.2c4.2,1.9,5.7,6.4,5.4,10.8C57,369.5,59.7,367.9,62,364.6"></path><path id="Fill-66-Copy" fill="#8AD4FF" d="M62,801.6c-0.2-5.2-5.9-7.1-8.7-10.6c-1.8,3.7-5.1,7.4-9.3,8.2c4.2,1.9,5.7,6.4,5.4,10.8C57,806.5,59.7,804.9,62,801.6"></path><path id="Fill-68" fill="#8AD4FF" d="M354,348.2l10.4-19.2c2.2,3,4.3,3.3,7.6,3.8c-4.6,7-7.5,11.6-10.4,19.2C357.9,351.7,356.3,350.5,354,348.2"></path><path id="Fill-68-Copy" fill="#8AD4FF" d="M354,785.2l10.4-19.2c2.2,3,4.3,3.3,7.6,3.8c-4.6,7-7.5,11.6-10.4,19.2C357.9,788.7,356.3,787.5,354,785.2"></path><path id="Fill-70" fill="#FFD510" d="M311.7,363l-16.7-5.3c2.2-1.8,2.2-3.3,2.3-5.7c6.1,2.5,10.2,4,16.7,5.3C314.1,359.9,313.3,361.1,311.7,363"></path><path id="Fill-70-Copy" fill="#FFD510" d="M311.7,800l-16.7-5.3c2.2-1.8,2.2-3.3,2.3-5.7c6.1,2.5,10.2,4,16.7,5.3C314.1,796.9,313.3,798.1,311.7,800"></path><path id="Fill-72" fill="#B68FFF" d="M144,396.1c1.3,1.4,1.3,3.6-0.1,4.9s-3.6,1.3-4.9-0.1c-1.3-1.4-1.3-3.6,0.1-4.9C140.5,394.6,142.7,394.7,144,396.1"></path><path id="Fill-72-Copy" fill="#B68FFF" d="M144,833.1c1.3,1.4,1.3,3.6-0.1,4.9c-1.4,1.3-3.6,1.3-4.9-0.1s-1.3-3.6,0.1-4.9C140.5,831.6,142.7,831.7,144,833.1"></path><path id="Fill-74" fill="#FFE019" d="M161,295.4c2,2.7,5,4.7,8.9,5.6c-0.4-1.8,1.3-3.1,3.1-3.5c-3.1-0.9-5.8-2.2-9.3-5.4c-0.4-0.4-1.6,1.2-2.2,2.2C161.3,294.6,161.2,295,161,295.4"></path><path id="Fill-74-Copy" fill="#FFE019" d="M161,732.4c2,2.7,5,4.7,8.9,5.6c-0.4-1.8,1.3-3.1,3.1-3.5c-3.1-0.9-5.8-2.2-9.3-5.4c-0.4-0.4-1.6,1.2-2.2,2.2C161.3,731.6,161.2,732,161,732.4"></path><path id="Fill-76" fill="#8AD4FF" d="M15.7,214.2l25.8-2.2c-1.7,3.7-0.7,5.7,0.8,8.8c-9.8,0.1-16.3,0.3-25.8,2.2C14.5,219.7,14.8,217.5,15.7,214.2"></path><path id="Fill-76-Copy" fill="#8AD4FF" d="M15.7,651.2l25.8-2.2c-1.7,3.7-0.7,5.7,0.8,8.8c-9.8,0.1-16.3,0.3-25.8,2.2C14.5,656.7,14.8,654.5,15.7,651.2"></path><path id="Fill-79" fill="#B68FFF" d="M374.7,451c2.6-3,4.2-6.9,4.3-11.6c-2,0.9-3.9-0.6-4.9-2.4c-0.3,3.8-1.3,7.2-4.1,12c-0.4,0.5,1.8,1.5,3.2,1.8C373.7,450.9,374.1,451,374.7,451"></path><path id="Fill-81" fill="#FFD510" d="M369,220.2c5.9,5.3,13.8,8.5,23.1,8.8c-1.8-3.9,1.3-7.8,5-9.6c-7.5-0.6-14.3-2.5-24-8.3c-1.1-0.8-3,3.6-3.7,6.2C369.2,218.2,369.1,219.2,369,220.2"></path><path id="Fill-81-Copy" fill="#FFD510" d="M369,657.2c5.9,5.3,13.8,8.5,23.1,8.8c-1.8-3.9,1.3-7.8,5-9.6c-7.5-0.6-14.3-2.5-24-8.3c-1.1-0.8-3,3.6-3.7,6.2C369.2,655.2,369.1,656.2,369,657.2"></path><path id="Fill-84" fill="#FFFFFF" d="M82.2,39.3c3.9-1.2,8.2,0.9,9.4,4.6c1.3,3.7-0.9,7.6-4.9,8.8c-3.9,1.2-8.2-0.9-9.4-4.6C76.1,44.4,78.3,40.5,82.2,39.3"></path><path id="Fill-86" fill="#FFFFFF" d="M101.3,588c-1.9-0.1-3.4-1.5-3.3-3.2s1.8-2.9,3.7-2.8c1.9,0.1,3.4,1.5,3.3,3.2C104.9,586.8,103.2,588.1,101.3,588"></path><path id="Fill-88" fill="#B68FFF" d="M311,53.9c2.3,3.3,6,5.8,10.9,7.1c-0.4-2.1,1.9-3.6,4.1-4c-3.9-1.2-7.2-3-11.4-6.9c-0.5-0.5-2.1,1.3-2.9,2.5C311.4,53,311.2,53.5,311,53.9"></path><path id="Fill-90" fill="#FF96AF" d="M364.8,575.8c0.7,2.1-0.5,4.4-2.6,5c-2.1,0.7-4.4-0.5-5-2.6c-0.7-2.1,0.5-4.4,2.6-5C361.9,572.5,364.2,573.7,364.8,575.8"></path><path id="Fill-92" fill="#B68FFF" d="M306.7,223.2c-2.5,4.4-3.3,9.7-2.2,15.3c2.2-1.7,5.1-0.4,6.8,1.5c-0.7-4.6-0.5-9,1.7-15.7c0.3-0.8-2.7-1.2-4.5-1.3C307.9,223,307.3,223.1,306.7,223.2"></path><path id="Fill-92-Copy" fill="#B68FFF" d="M306.7,660.2c-2.5,4.4-3.3,9.7-2.2,15.3c2.2-1.7,5.1-0.4,6.8,1.5c-0.7-4.6-0.5-9,1.7-15.7c0.3-0.8-2.7-1.2-4.5-1.3C307.9,660,307.3,660.1,306.7,660.2"></path><path id="Fill-94" fill="#FFE019" d="M298.5,3.1L314.6,2c-1.1,2-0.5,3.1,0.4,4.9c-6.1,0-10.2,0.1-16.1,1.1C297.7,6.1,297.9,5,298.5,3.1"></path><path id="Fill-96" fill="#FF96AF" d="M66.4,93.1c1.2-4.2,0.8-8.7-1.3-13.1c-1.5,1.9-4.2,1.4-6,0.2c1.6,3.7,2.3,7.4,1.8,13.3c-0.1,0.7,2.5,0.5,4,0.1C65.3,93.5,65.8,93.3,66.4,93.1"></path><path id="Fill-98" fill="#8AD4FF" d="M79,609l-5.5,14c-1.7-1.9-3.2-1.9-5.5-2c2.5-5.1,4.1-8.5,5.5-14C76,606.9,77.2,607.6,79,609"></path><path id="Fill-101" fill="#B68FFF" d="M350.9,613.3c-3.5-2-7.8-2.7-12.5-2c1.3,1.7,0.2,3.8-1.4,5c3.9-0.4,7.5-0.1,12.8,1.7c0.6,0.3,1.1-2,1.2-3.3C351,614.3,350.9,613.8,350.9,613.3"></path><path id="Fill-104" fill="#8AD4FF" d="M306.1,487c4.9-5.9,7.5-13.2,6.7-21.6c-3.9,2-8.4-0.4-10.7-3.4c0.2,6.7-1.1,13-6.1,22.3c-0.7,1,4.1,2.3,7,2.7C304,487,305,487,306.1,487"></path><path id="Fill-106" fill="#FFD510" d="M271.2,92.1c-1.9,2.8-2.7,6.2-1.8,9.9c1.7-1.1,3.9-0.2,5.2,1c-0.5-3-0.3-5.8,1.5-10.1c0.3-0.5-2-0.8-3.4-0.9C272.1,92,271.7,92.1,271.2,92.1"></path><path id="Fill-108" fill="#FFFFFF" d="M339,292.6c1.9,5.1,5.8,9.4,11.6,12.4c0.2-3,3.5-4.5,6.4-4.5c-4.5-2.6-8.2-5.8-12.3-12.3c-0.4-0.8-3.1,1.3-4.5,2.8C339.8,291.5,339.4,292,339,292.6"></path><path id="Fill-108-Copy" fill="#FFFFFF" d="M339,729.6c1.9,5.1,5.8,9.4,11.6,12.4c0.2-3,3.5-4.5,6.4-4.5c-4.5-2.6-8.2-5.8-12.3-12.3c-0.4-0.8-3.1,1.3-4.5,2.8C339.8,728.5,339.4,729,339,729.6"></path><path id="Fill-110" fill="#B68FFF" d="M384.5,362.9c2.3-2,1-4.9,1.5-7.2c-2.3,0.6-5.3,0.6-7.2-0.7c0.7,2.3-0.7,4.6-2.8,6C380.4,362.8,382.1,363.2,384.5,362.9"></path><path id="Fill-110-Copy" fill="#B68FFF" d="M384.5,799.9c2.3-2,1-4.9,1.5-7.2c-2.3,0.6-5.3,0.6-7.2-0.7c0.7,2.3-0.7,4.6-2.8,6C380.4,799.8,382.1,800.2,384.5,799.9"></path><path id="Fill-112" fill="#FFE019" d="M213.9,362.4c-1.6,1.9-4.5,2.1-6.3,0.5c-1.9-1.6-2.1-4.5-0.5-6.3c1.6-1.9,4.5-2.1,6.3-0.5C215.3,357.7,215.5,360.6,213.9,362.4"></path><path id="Fill-112-Copy" fill="#FFE019" d="M213.9,799.4c-1.6,1.9-4.5,2.1-6.3,0.5c-1.9-1.6-2.1-4.5-0.5-6.3c1.6-1.9,4.5-2.1,6.3-0.5C215.3,794.7,215.5,797.6,213.9,799.4"></path><path id="Fill-114" fill="#FFFFFF" d="M77.6,219.8c5.9,1.3,9.7-3.7,14.4-5.5c-3.6-2.8-6.7-7.1-6.4-11.3c-3.4,3.5-8.8,3.7-13.6,2.2C73.5,212.9,74.3,216.3,77.6,219.8"></path><path id="Fill-114-Copy" fill="#FFFFFF" d="M77.6,656.8c5.9,1.3,9.7-3.7,14.4-5.5c-3.6-2.8-6.7-7.1-6.4-11.3c-3.4,3.5-8.8,3.7-13.6,2.2C73.5,649.9,74.3,653.3,77.6,656.8"></path><path id="Fill-116" fill="#8AD4FF" d="M312.9,152.2c-1.5-2-1.1-4.8,0.9-6.3c2-1.5,4.8-1.1,6.3,0.9c1.5,2,1.1,4.8-0.9,6.3C317.2,154.6,314.4,154.2,312.9,152.2"></path><path id="Fill-116-Copy" fill="#8AD4FF" d="M312.9,589.2c-1.5-2-1.1-4.8,0.9-6.3c2-1.5,4.8-1.1,6.3,0.9c1.5,2,1.1,4.8-0.9,6.3C317.2,591.6,314.4,591.2,312.9,589.2"></path><path id="Fill-118" fill="#FFD510" d="M206.8,111.8c-0.8,2.4-3.6,3.7-6.2,3c-2.6-0.7-4.1-3.2-3.3-5.6c0.8-2.4,3.6-3.7,6.2-3C206.1,106.9,207.6,109.4,206.8,111.8"></path><path id="Fill-120" fill="#FFFFFF" d="M339,423.2c-3-3.6-7.3-6.1-12.9-7.2c0.6,2.4-1.7,4.3-4.1,5c4.4,1.1,8.3,2.8,13.5,6.9c0.6,0.5,2.2-1.7,3-3.2C338.6,424.3,338.8,423.7,339,423.2"></path><path id="Fill-120-Copy" fill="#FFFFFF" d="M339,860.2c-3-3.6-7.3-6.1-12.9-7.2c0.6,2.4-1.7,4.3-4.1,5c4.4,1.1,8.3,2.8,13.5,6.9c0.6,0.5,2.2-1.7,3-3.2C338.6,861.3,338.8,860.7,339,860.2"></path><path id="Fill-122" fill="#8AD4FF" d="M142.9,43c7.5-2.5,13.8-7.5,18.1-14.9c-4.4-0.2-6.7-4.3-6.8-8.1c-3.8,5.8-8.4,10.5-17.9,15.8c-1.2,0.5,2,3.9,4.2,5.6C141.2,42,142,42.5,142.9,43"></path><path id="Fill-124" fill="#8AD4FF" d="M235.7,207c3.3-4.5-0.5-9.4-0.7-14c-4,2.1-9.4,3.3-13.6,1.6c2.4,4,0.8,8.7-2.4,12.2C228,208.3,231.4,208.4,235.7,207"></path><path id="Fill-124-Copy" fill="#8AD4FF" d="M235.7,644c3.3-4.5-0.5-9.4-0.7-14c-4,2.1-9.4,3.3-13.6,1.6c2.4,4,0.8,8.7-2.4,12.2C228,645.3,231.4,645.4,235.7,644"></path><path id="Fill-126" fill="#B68FFF" d="M186.7,465c-3.5,3-5.9,7.3-6.7,12.6c2.5-0.8,4.6,1.2,5.5,3.4c0.8-4.2,2.3-8,6.4-13.1c0.5-0.6-2-1.9-3.6-2.5C187.9,465.3,187.3,465.1,186.7,465"></path><path id="Fill-128" fill="#B68FFF" d="M48.7,283.3c-3.7,1.6-8.2,0.1-10-3.4c-1.8-3.5-0.1-7.7,3.6-9.3c3.7-1.6,8.2-0.1,10,3.4C54,277.5,52.4,281.7,48.7,283.3"></path><path id="Fill-128-Copy" fill="#B68FFF" d="M48.7,720.3c-3.7,1.6-8.2,0.1-10-3.4c-1.8-3.5-0.1-7.7,3.6-9.3c3.7-1.6,8.2-0.1,10,3.4C54,714.5,52.4,718.7,48.7,720.3"></path><path id="Fill-130" fill="#FFFFFF" d="M104.2,454.8c2.8,1.6,3.7,5,1.9,7.6c-1.8,2.6-5.4,3.4-8.3,1.8c-2.8-1.6-3.7-5-1.9-7.6S101.4,453.2,104.2,454.8"></path><path id="Fill-132" fill="#B68FFF" d="M149.9,612.2c1.7-2.3,5.1-2.9,7.6-1.3s3.2,4.7,1.5,6.9c-1.7,2.3-5.1,2.9-7.6,1.3C148.9,617.6,148.2,614.5,149.9,612.2"></path><path id="Fill-135" fill="#8AD4FF" d="M230.9,558.8L231,578c-3.1-1.5-5-0.9-7.9-0.1c0.6-7.3,1-12-0.1-19.2C226.1,557.6,228,557.9,230.9,558.8"></path><path id="Fill-137" fill="#B68FFF" d="M138,235.8L126.7,254c-2.1-3-4.3-3.3-7.7-3.8c4.9-6.6,8.1-10.9,11.3-18.2C134.1,232.4,135.7,233.6,138,235.8"></path><path id="Fill-137-Copy" fill="#B68FFF" d="M138,672.8L126.7,691c-2.1-3-4.3-3.3-7.7-3.8c4.9-6.6,8.1-10.9,11.3-18.2C134.1,669.4,135.7,670.6,138,672.8"></path><path id="Fill-139" fill="#8AD4FF" d="M133.9,352c5-4.3,8.3-10.3,9.1-17.6c-3.6,1.2-6.8-1.5-8.2-4.4c-1,5.8-3,11-8.7,18.2c-0.7,0.8,3,2.5,5.3,3.3C132.2,351.7,133,351.9,133.9,352"></path><path id="Fill-139-Copy" fill="#8AD4FF" d="M133.9,789c5-4.3,8.3-10.3,9.1-17.6c-3.6,1.2-6.8-1.5-8.2-4.4c-1,5.8-3,11-8.7,18.2c-0.7,0.8,3,2.5,5.3,3.3C132.2,788.7,133,788.9,133.9,789"></path><path id="Fill-141" fill="#8AD4FF" d="M20.1,107.8c0.4-2.5,3-4.1,5.7-3.7c2.7,0.4,4.6,2.7,4.2,5.2c-0.4,2.5-3,4.1-5.7,3.7C21.5,112.6,19.6,110.2,20.1,107.8"></path><path id="Fill-144" fill="#B68FFF" d="M340.9,532.3l-19,4.7c0.7-2.9-0.3-4.2-1.9-6.3c7.4-1.3,12.2-2.2,19-4.7C341,528.2,341.1,529.7,340.9,532.3"></path><path id="Fill-146" fill="#FFE019" d="M228.7,152.6c-2.2-1.9-2.2-5.1-0.1-7.1c2.1-2,5.6-2,7.8-0.1c2.2,1.9,2.2,5.1,0.1,7.1C234.4,154.5,230.9,154.5,228.7,152.6"></path><path id="Fill-146-Copy" fill="#FFE019" d="M228.7,589.6c-2.2-1.9-2.2-5.1-0.1-7.1c2.1-2,5.6-2,7.8-0.1c2.2,1.9,2.2,5.1,0.1,7.1C234.4,591.5,230.9,591.5,228.7,589.6"></path><path id="Fill-148" fill="#B68FFF" d="M149,164.4l24-0.4c-1.9,3-1.1,4.8,0.1,7.6c-9.1-0.5-15-0.7-24,0.4C147.5,169,147.9,167.2,149,164.4"></path><path id="Fill-148-Copy" fill="#B68FFF" d="M149,601.4l24-0.4c-1.9,3-1.1,4.8,0.1,7.6c-9.1-0.5-15-0.7-24,0.4C147.5,606,147.9,604.2,149,601.4"></path></svg>',
            getSvg: function (t) {
                if (t && t > 0)
                    return this[String(t)]
            }
        };
        window.Font = a;
        var o = "sdk_adw"
            , n = "sdk_analytics";
        jQuery(function () {
            var t = $("body")
                , e = $(".lang-menu-label")
                , o = $(".lang-menu-dropdown")
                , n = $(".main-navigation")
                , c = $("#cookies-banner")
                , r = !1
                , s = $(".sudoku-list-item")
                , p = $(".answers-block-item");
            !function () {
                var t = [];
                p && 4 === p.length && (t.push(p.eq(1)),
                    t.push(p.eq(2)),
                    t.push(p.eq(0)),
                    t.push(p.eq(3)));
                p = t
            }();
            var h = $(".button-google-play")[0]
                , F = $(".button-app-store")[0];
            function g() {
                var t = window.location.pathname.slice(1, 3);
                return l.languages.indexOf(t) < 0 && (t = "en"),
                    window.lang = t,
                    t
            }
            h && h.addEventListener("click", function () {
                "undefined" != typeof gtag && gtag("event", "gp_badge_click")
            }, !0),
                F && F.addEventListener("click", function () {
                    "undefined" != typeof gtag && gtag("event", "ios_badge_click")
                }, !0),
                e.on("click", function (t) {
                    window.innerWidth <= 980 || (t.stopPropagation(),
                        o.fadeToggle(200),
                        e.toggleClass("lang-menu-open"))
                }),
                $(".burger-icon").on("click", function () {
                    n.fadeToggle(200),
                        t.toggleClass("menu-open")
                }),
                t.on("click", function () {
                    e.hasClass("lang-menu-open") && (o.fadeOut(200),
                        e.removeClass("lang-menu-open"))
                }),
                $(".lang-menu-select").on("change", function () {
                    this.value && (window.location.href = this.value)
                }),
                $(".action-print").on("click", function () {
                    r || (s.length < 1 || ($(this).addClass("loading"),
                        r = !0,
                        function (t, e) {
                            var o = window.calendar.getDate() || new Date;
                            if ("undefined" != typeof gtag) {
                                var n = new Date;
                                n.getDate() === o.getDate() && n.getMonth() === o.getMonth() && n.getFullYear() === o.getFullYear() ? gtag("event", "printed_today_" + t) : gtag("event", "printed_past_" + t)
                            }
                            (function (t, e) {
                                var i = function (t) {
                                    var e = t.getMonth() < 9 ? "0" + (t.getMonth() + 1) : t.getMonth() + 1
                                        , i = t.getDate() < 9 ? "0" + t.getDate() : t.getDate();
                                    return t.getFullYear() + "-" + e + "-" + i
                                }(e);
                                return $.ajax({
                                    url: location.protocol + "//" + location.host + "/api/level/" + t + "/" + i
                                })
                            }
                            )(t, o).done(function (n) {
                                if (n.length < 4 || "object" !== i(n))
                                    return $(".print-btn.loading").removeClass("loading"),
                                        void (r = !1);
                                n.length > 4 && (n.length = 4),
                                    function (t, e) {
                                        for (var i = 0; i < t.length; i++) {
                                            var l, o, n = s.eq(i), c = p[i], d = c.find(".cell-value"), r = c.find(".answer-block-item-header"), h = t[i], F = h.mission, g = h.solution, u = h.id, f = n.find(".cell-value"), v = n.find(".sudoku-id");
                                            v.html("#" + u),
                                                r.html("#" + u);
                                            for (var m = 0; m < F.length; m++)
                                                o = F[m],
                                                    (l = f[m]).innerHTML = o > 0 ? a.getSvg(o) : "",
                                                    e && (l = d[m],
                                                        o > 0 ? (l.innerHTML = a.getSvg(o),
                                                            l.classList.remove("answer-value")) : (l.classList.add("answer-value"),
                                                                l.innerHTML = a.getSvg(g[m])))
                                        }
                                    }(n, e);
                                var c = window.lang || g()
                                    , d = o.getDate()
                                    , h = l.monthFull[c][o.getMonth()]
                                    , F = o.getFullYear();
                                $(".printable .heading-date").html(d + " " + h + " " + F),
                                    e ? $(".printable").addClass("printable-with-answers") : $(".printable").removeClass("printable-with-answers"),
                                    $(".printable .heading-difficulty").hide().filter(".difficulty-" + t).show(),
                                    $(".print-btn.loading").removeClass("loading"),
                                    r = !1,
                                    window.print(),
                                    window.calendar.markPrinted(t)
                            }).fail(function () {
                                console.log("fail"),
                                    $(".print-btn.loading").removeClass("loading"),
                                    r = !1
                            })
                        }($(this).data("difficulty") || "easy", $(this).data("answers") || !1)))
                }),
                function () {
                    var t = $("#current-date");
                    if (t.length > 0) {
                        var e = new Date
                            , i = window.lang || g()
                            , a = e.getDate() + " " + l.monthFull[i][e.getMonth()] + " " + e.getFullYear();
                        t.html(a)
                    }
                }();
            var u, f, v, m, w = g(), b = l.sudokuText[w] || "Sudoku", C = l.gpText[w] || "FREE - In Google Play", M = l.iosText[w] || "GET - On the App Store", k = l.installText[w] || "Install", y = l.viewText[w] || "View", A = "https://itunes.apple.com" + l.iosLink[w] + "/app/id1193508329", D = '<div class="mobile-smart android-smart"><div class="smart-wrapper"><div class="smart-close icon-close"></div><img class="app-icon" srcset="/img/icon_app_android.png 1x, /img/icon_app_android@2x.png 2x" src="/img/icon_app_android.png" alt="sudoku app icon"/><div class="app-info"><div class="app-info-heading">' + b + '</div><div class="app-info-author">Easybrain</div><div class="app-info-description">' + C + '</div></div><a class="app-button" href="https://app.adjust.com/q6uigfl">' + k + "</a></div></div>", S = '<div class="mobile-smart ios-smart"><div class="smart-wrapper"><div class="smart-close icon-close"></div><img class="app-icon" srcset="/img/icon-app.png 1x, /img/icon-app@2x.png 2x" src="/img/icon-app.png" alt="sudoku app icon"/><div class="app-info"><div class="app-info-heading">' + b + '</div><div class="app-info-author">Easybrain</div><div class="app-info-stars"><div class="icon-star-ios"></div><div class="icon-star-ios"></div><div class="icon-star-ios"></div><div class="icon-star-ios"></div><div class="icon-star-ios-half"></div></div><div class="app-info-description">' + M + '</div></div><a class="app-button" href="' + A + '">' + y + "</a></div></div>", x = navigator.userAgent.toLowerCase().indexOf("android") > -1, T = /iPad|iPhone|iPod/.test(navigator.userAgent) && !window.MSStream, L = /CriOS/i.test(navigator.userAgent), z = /FxiOS/i.test(navigator.userAgent), B = /UCBrowser/i.test(navigator.userAgent), _ = /^((?!chrome|android).)*safari/i.test(navigator.userAgent), E = function () {
                var e = !1;
                window.innerWidth > window.innerHeight ? (t.removeClass("portrait").addClass("landscape"),
                    e = !1) : (t.removeClass("landscape").addClass("portrait"),
                        e = !0),
                    e && window.innerWidth / window.innerHeight > .67 || !e && window.innerWidth / window.innerHeight < 1.5 ? t.addClass("tablet") : t.removeClass("tablet")
            };
            E(),
                u = "<script>!function(f,b,e,v,n,t,s){if(f.fbq)return;n=f.fbq=function(){n.callMethod?n.callMethod.apply(n,arguments):n.queue.push(arguments)};if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0';n.queue=[];t=b.createElement(e);t.async=!0;t.src=v;s=b.getElementsByTagName(e)[0];s.parentNode.insertBefore(t,s)}(window,document,'script','https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '" + (T ? "291539101484156" : x ? "1632348356868649" : "633344124170585") + "'); fbq('track', 'PageView');<\/script>",
                t.append(u),
                v = !1,
                f = navigator.userAgent || navigator.vendor || window.opera,
                (/(android|bb\d+|meego).+mobile|avantgo|bada\/|blackberry|blazer|compal|elaine|fennec|hiptop|iemobile|ip(hone|od)|iris|kindle|lge |maemo|midp|mmp|mobile.+firefox|netfront|opera m(ob|in)i|palm( os)?|phone|p(ixi|re)\/|plucker|pocket|psp|series(4|6)0|symbian|treo|up\.(browser|link)|vodafone|wap|windows ce|xda|xiino|android|ipad|playbook|silk/i.test(f) || /1207|6310|6590|3gso|4thp|50[1-6]i|770s|802s|a wa|abac|ac(er|oo|s\-)|ai(ko|rn)|al(av|ca|co)|amoi|an(ex|ny|yw)|aptu|ar(ch|go)|as(te|us)|attw|au(di|\-m|r |s )|avan|be(ck|ll|nq)|bi(lb|rd)|bl(ac|az)|br(e|v)w|bumb|bw\-(n|u)|c55\/|capi|ccwa|cdm\-|cell|chtm|cldc|cmd\-|co(mp|nd)|craw|da(it|ll|ng)|dbte|dc\-s|devi|dica|dmob|do(c|p)o|ds(12|\-d)|el(49|ai)|em(l2|ul)|er(ic|k0)|esl8|ez([4-7]0|os|wa|ze)|fetc|fly(\-|_)|g1 u|g560|gene|gf\-5|g\-mo|go(\.w|od)|gr(ad|un)|haie|hcit|hd\-(m|p|t)|hei\-|hi(pt|ta)|hp( i|ip)|hs\-c|ht(c(\-| |_|a|g|p|s|t)|tp)|hu(aw|tc)|i\-(20|go|ma)|i230|iac( |\-|\/)|ibro|idea|ig01|ikom|im1k|inno|ipaq|iris|ja(t|v)a|jbro|jemu|jigs|kddi|keji|kgt( |\/)|klon|kpt |kwc\-|kyo(c|k)|le(no|xi)|lg( g|\/(k|l|u)|50|54|\-[a-w])|libw|lynx|m1\-w|m3ga|m50\/|ma(te|ui|xo)|mc(01|21|ca)|m\-cr|me(rc|ri)|mi(o8|oa|ts)|mmef|mo(01|02|bi|de|do|t(\-| |o|v)|zz)|mt(50|p1|v )|mwbp|mywa|n10[0-2]|n20[2-3]|n30(0|2)|n50(0|2|5)|n7(0(0|1)|10)|ne((c|m)\-|on|tf|wf|wg|wt)|nok(6|i)|nzph|o2im|op(ti|wv)|oran|owg1|p800|pan(a|d|t)|pdxg|pg(13|\-([1-8]|c))|phil|pire|pl(ay|uc)|pn\-2|po(ck|rt|se)|prox|psio|pt\-g|qa\-a|qc(07|12|21|32|60|\-[2-7]|i\-)|qtek|r380|r600|raks|rim9|ro(ve|zo)|s55\/|sa(ge|ma|mm|ms|ny|va)|sc(01|h\-|oo|p\-)|sdk\/|se(c(\-|0|1)|47|mc|nd|ri)|sgh\-|shar|sie(\-|m)|sk\-0|sl(45|id)|sm(al|ar|b3|it|t5)|so(ft|ny)|sp(01|h\-|v\-|v )|sy(01|mb)|t2(18|50)|t6(00|10|18)|ta(gt|lk)|tcl\-|tdg\-|tel(i|m)|tim\-|t\-mo|to(pl|sh)|ts(70|m\-|m3|m5)|tx\-9|up(\.b|g1|si)|utst|v400|v750|veri|vi(rg|te)|vk(40|5[0-3]|\-v)|vm40|voda|vulc|vx(52|53|60|61|70|80|81|83|85|98)|w3c(\-| )|webc|whit|wi(g |nc|nw)|wmlb|wonu|x700|yas\-|your|zeto|zte\-/i.test(f.substr(0, 4))) && (v = !0),
                v && (t.addClass("mobile"),
                    x && (localStorage.getItem("hideAndroidSmartBanner") || setTimeout(function () {
                        t.append(D),
                            setTimeout(function () {
                                t.addClass("smart-visible"),
                                    gtag("event", "gp_smartbanner_show"),
                                    $(".smart-close").on("click", function () {
                                        t.removeClass("smart-visible"),
                                            localStorage.setItem("hideAndroidSmartBanner", !0)
                                    }),
                                    $(".android-smart").find(".app-button")[0].addEventListener("click", function () {
                                        "undefined" != typeof gtag && gtag("event", "gp_smartbanner_click")
                                    }, !0)
                            }, 0)
                    }, 1e3)),
                    function () {
                        if (T) {
                            if (!(L || z || B) && _)
                                return;
                            localStorage.getItem("hideIosSmartBanner") || setTimeout(function () {
                                t.append(S),
                                    setTimeout(function () {
                                        t.addClass("smart-visible"),
                                            gtag("event", "ios_smartbanner_show"),
                                            $(".smart-close").on("click", function () {
                                                t.removeClass("smart-visible"),
                                                    localStorage.setItem("hideIosSmartBanner", !0)
                                            }),
                                            $(".ios-smart").find(".app-button")[0].addEventListener("click", function () {
                                                "undefined" != typeof gtag && gtag("event", "ios_smartbanner_click")
                                            }, !0)
                                    }, 0)
                            }, 1e3)
                        }
                    }()),
                $(window).on("resize", function () {
                    clearTimeout(m),
                        m = setTimeout(function () {
                            if (E(),
                                window.innerWidth > 980 && ($("#site-navigation").removeAttr("style"),
                                    t.removeClass("menu-open")),
                                c.is(":visible")) {
                                var e = c.outerHeight(!0);
                                t.addClass("cookie-visible").css("padding-bottom", e),
                                    $(".main-navigation").css("bottom", e - 1)
                            }
                        }, 100)
                });
            var I = $(".cookies-popup")
                , P = $("#cookies-options");
            t.hasClass("cookies-page") && $(".entry-content a").on("click", function (t) {
                var e = $(this).attr("href");
                "#show-cookie-preferences" === e ? (t.preventDefault(),
                    t.stopPropagation(),
                    d()) : e.indexOf("http") > -1 && (t.preventDefault(),
                        t.stopPropagation(),
                        window.open(e, "_blank"))
            }),
                $(".cookie-settings-link").on("click", function (t) {
                    t.preventDefault(),
                        t.stopPropagation(),
                        d(!0)
                }),
                $(".popup-close").on("click", function () {
                    I.removeClass("shown"),
                        c.show()
                }),
                $("#cookies-options-dropdown").on("change", function () {
                    var t = this.value;
                    $(".options-content-wrapper").find(".options-content").hide().filter(".cookies-category-" + t).show()
                }),
                P.on("click", "li", function () {
                    var t = $(this).attr("data-category");
                    P.find("li").removeClass("active"),
                        $(this).addClass("active"),
                        $(".options-content-wrapper").find(".options-content").hide().filter(".cookies-category-" + t).show()
                });
            var G = parseInt(c.css("padding-bottom"))
                , O = 0;
            !T || !_ || L || z || B || function t() {
                setTimeout(function () {
                    var e = $(window).innerHeight() - window.innerHeight;
                    e > 0 ? (H || (gtag("event", "ios_smartbanner_show"),
                        H = !0),
                        c.is(":visible") && c.css("padding-bottom", e + G + "px")) : c.is(":visible") && c.css("padding-bottom", ""),
                        ++O < 30 && t()
                }, 200)
            }();
            var H = !1;
            $(window).trigger("resize")
        });
        var c = c || null;
        function d(t) {
            t || $("#cookies-popup-close").hide(),
                $("#cookies-consent").show(),
                $(".cookies-popup").addClass("shown"),
                $(".cookies-banner").hide(),
                $("#sdk_google_adw").prop("checked", !!+window.globalAppAction.getCookie(o)),
                $("#sdk_google_analytics").prop("checked", !!+window.globalAppAction.getCookie(n)),
                c && (c.controlsDisabled = !0)
        }
        !function (t) {
            t("#cookies-save").on("click", function (e) {
                e.preventDefault();
                var i = t("#sdk_google_adw").is(":checked")
                    , l = t("#sdk_google_analytics").is(":checked");
                window.globalAppAction.setCookie(o, +i, 365),
                    window.globalAppAction.setCookie(n, +l, 365),
                    window.globalAppAction.setCookie("sdk_confirm", 1, 365),
                    r("close"),
                    location.reload()
            }),
                t(".cookies-accept").on("click", function (t) {
                    t.preventDefault(),
                        window.globalAppAction.setCookie(o, 1, 365),
                        window.globalAppAction.setCookie(n, 1, 365),
                        window.globalAppAction.setCookie("sdk_confirm", 1, 365),
                        r("close"),
                        location.reload()
                })
        }(jQuery);
        var r = function (t) {
            switch (t) {
                case "open":
                    return (e = $("#cookies-consent")).length > 0 && e.show(),
                        $("body").css("padding-bottom", $("#cookies-banner").outerHeight(!0)),
                        !0;
                case "close":
                    return $("#cookies-consent").hide(),
                        c && (c.controlsDisabled = !1),
                        $("body").css("padding-bottom", 0),
                        !0;
                default:
                    return !1
            }
            var e
        };
        window.globalAppAction = {
            setCookie: function (t, e, i) {
                var l = new Date;
                l.setTime(l.getTime() + 24 * i * 60 * 60 * 1e3);
                var a = "expires=" + l.toUTCString();
                document.cookie = t + "=" + e + ";" + a + ";path=/"
            },
            getCookie: function (t) {
                for (var e = t + "=", i = decodeURIComponent(document.cookie).split(";"), l = 0; l < i.length; l++) {
                    for (var a = i[l]; " " == a.charAt(0);)
                        a = a.substring(1);
                    if (0 == a.indexOf(e))
                        return a.substring(e.length, a.length)
                }
                return ""
            },
            showCookiesPreferences: function () {
                d()
            }
        },
            window.calendar = new function () {
                var t = {
                    difficulty: "easy",
                    firstDate: new Date("Apr 01 2019"),
                    sundayFirst: !1,
                    rtl: !1,
                    disablePastDays: !1,
                    disableFutureDays: !0
                }
                    , e = {
                        monthLabel: document.getElementById("calendar-month-label"),
                        week: document.getElementById("calendar-week"),
                        body: document.getElementById("calendar-body"),
                        prevBtn: document.getElementById("prev-month-btn"),
                        nextBtn: document.getElementById("next-month-btn"),
                        printDate: document.getElementById("selected-date-label")
                    }
                    , i = new Date
                    , a = new Date
                    , o = new Date
                    , n = {};
                function c() {
                    var t = window.location.pathname.slice(1, 3);
                    return l.languages.indexOf(t) < 0 && (t = "en"),
                        window.lang = t,
                        t
                }
                function d() {
                    var l, a, c, d, s, h, F, g, u, f, v, m = new Date(i), w = i.getMonth(), b = i.getFullYear(), C = new Date, M = C.getMonth(), k = C.getFullYear();
                    for (t.firstDate && w === t.firstDate.getMonth() && b === t.firstDate.getFullYear() ? e.prevBtn.classList.add("calendar-btn--disabled") : e.prevBtn.classList.remove("calendar-btn--disabled"),
                        w === M && b === k ? e.nextBtn.classList.add("calendar-btn--disabled") : e.nextBtn.classList.remove("calendar-btn--disabled"); m.getMonth() === w;)
                        c = void 0,
                            d = void 0,
                            s = void 0,
                            h = void 0,
                            F = void 0,
                            g = void 0,
                            u = void 0,
                            f = void 0,
                            v = void 0,
                            d = (a = m).getDate(),
                            s = a.getDay(),
                            h = document.createElement("div"),
                            F = document.createElement("div"),
                            g = document.createElement("div"),
                            u = t.sundayFirst ? s : s - 1,
                            f = t.rtl ? "marginRight" : "marginLeft",
                            v = !1,
                            g.className = "calendar-date-value",
                            g.innerHTML = String(d),
                            F.className = "calendar-date-content",
                            h.className = "calendar-date",
                            h.setAttribute("data-calendar-date", a),
                            c = a.getMonth() + 1 + "-" + d + "-" + a.getFullYear(),
                            h.setAttribute("data-value", c),
                            n && n.length && n.indexOf(c) > -1 && h.classList.add("calendar-date--printed"),
                            1 === d && (0 === s ? t.sundayFirst || (h.style[f] = "85.7142%") : h.style[f] = 14.2857 * u + "%"),
                            t.disablePastDays && a.getTime() <= o.getTime() - 1 && (h.classList.add("calendar-date--disabled"),
                                v = !0),
                            t.disableFutureDays && a.getTime() > o.getTime() && (h.classList.add("calendar-date--disabled"),
                                v = !0),
                            v || (h.classList.add("calendar-date--active"),
                                h.setAttribute("data-calendar-status", "active")),
                            a.toString() === o.toString() && h.classList.add("calendar-date--today"),
                            F.appendChild(g),
                            h.appendChild(F),
                            h.appendChild(F),
                            e.body.appendChild(h),
                            m.setDate(m.getDate() + 1);
                    e.monthLabel.innerHTML = r(w) + ", " + b,
                        t.rtl && e.body.classList.add("rtl"),
                        p((l = e.body.querySelectorAll(".calendar-date--active"))[l.length - 1])
                }
                function r(t) {
                    var e = window.lang || c();
                    return l.monthFull[e][t]
                }
                function s(t) {
                    var l;
                    "next" === t ? l = i.getMonth() + 1 : "prev" === t && (l = i.getMonth() - 1),
                        i.setMonth(l),
                        e.body.innerHTML = "",
                        d()
                }
                function p(t) {
                    if (t && !t.classList.contains("calendar-date--disabled")) {
                        var i = e.body.querySelectorAll(".calendar-date--selected");
                        if (i.length)
                            for (var l = 0; l < i.length; l++)
                                i[l].classList.remove("calendar-date--selected");
                        t.classList.add("calendar-date--selected"),
                            a = new Date(t.dataset.calendarDate),
                            e.printDate.innerText = a.getDate() + " " + r(a.getMonth()) + " " + a.getFullYear()
                    }
                }
                this.markPrinted = function (t) {
                    var e, i = $(".calendar-date--selected");
                    n = localStorage.getItem("printed" + t),
                        i && i.length > 0 ? (e = i.data("value"),
                            i.addClass("calendar-date--printed")) : e = this.getFormattedDate(),
                        (n = n ? JSON.parse(n) : []) && -1 === n.indexOf(e) && (n.push(e),
                            localStorage.setItem("printed" + t, JSON.stringify(n)))
                }
                    ,
                    this.getDate = function () {
                        return a
                    }
                    ,
                    this.getFormattedDate = function () {
                        return a.getMonth() + 1 + "-" + a.getDate() + "-" + a.getFullYear()
                    }
                    ,
                    function () {
                        var a = document.getElementById("print-btn");
                        if (t.difficulty = a && a.dataset.difficulty || "easy",
                            e.body) {
                            var o = localStorage.getItem("printed" + t.difficulty);
                            o && (n = JSON.parse(o)),
                                i.setDate(1),
                                function () {
                                    var i, a = window.lang || c(), o = l.weekDays[a], n = o.pop(), d = "";
                                    for (t.rtl && e.week.classList.add("rtl"),
                                        i = 0; i < 6; i++)
                                        (d = document.createElement("span")).innerHTML = o[i],
                                            e.week.appendChild(d);
                                    (d = document.createElement("span")).innerHTML = n,
                                        t.sundayFirst ? e.week.insertBefore(d, e.week.firstChild) : e.week.appendChild(d)
                                }(),
                                d(),
                                e.prevBtn.addEventListener("click", function () {
                                    s("prev")
                                }),
                                e.nextBtn.addEventListener("click", function () {
                                    s("next")
                                }),
                                e.body.addEventListener("click", function (t) {
                                    var e = t && t.target && t.target.closest(".calendar-date") || null;
                                    e && p(e)
                                })
                        }
                    }()
            }
    },
    kdLP: function (t, e, i) { }
}, [["OYwG", "runtime"]]]);
